In [1]:
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
import re
%matplotlib inline

In [2]:
master = pd.read_csv('C:/Users/19739/Desktop/Money Ball/Money_Ball/Resources/People.csv', parse_dates=['debut', 'finalGame'])
# Currently not caring about pitchers

In [3]:
bbmaster = master[['playerID', 'nameFirst', 'nameLast', 'nameGiven']]
print(len(bbmaster))
bbmaster.head(2)

20370

    playerID nameFirst nameLast    nameGiven
0  aardsda01     David  Aardsma  David Allan
1  aaronha01      Hank    Aaron  Henry Louis

In [4]:
batting = pd.read_csv('C:/Users/19739/Desktop/Money Ball/Money_Ball/Resources/Batting.csv')
batting.columns

Index(['playerID', 'yearID', 'stint', 'teamID', 'lgID', 'G', 'AB', 'R', 'H',
       '2B', '3B', 'HR', 'RBI', 'SB', 'CS', 'BB', 'SO', 'IBB', 'HBP', 'SH',
       'SF', 'GIDP'],
      dtype='object')

In [5]:
print(len(batting))
batting.head(2)

110495

,playerID,yearID,stint,teamID,lgID,G,AB,R,H,2B,...,RBI,SB,CS,BB,SO,IBB,HBP,SH,SF,GIDP
0,abercda01,1871,1,TRO,NaN,1,4,0,0,0,...,0.0,0.0,0.0,0,0.0,NaN,NaN,NaN,NaN,0.0
1,addybo01,1871,1,RC1,NaN,25,118,30,32,6,...,13.0,8.0,1.0,4,0.0,NaN,NaN,NaN,NaN,0.0

In [6]:
master_batting = pd.merge(master, batting)

In [7]:
batting.columns

Index(['playerID', 'yearID', 'stint', 'teamID', 'lgID', 'G', 'AB', 'R', 'H',
       '2B', '3B', 'HR', 'RBI', 'SB', 'CS', 'BB', 'SO', 'IBB', 'HBP', 'SH',
       'SF', 'GIDP'],
      dtype='object')

In [8]:
bats = batting[['playerID', 'yearID','AB', 'H', 'BB', 'HBP', 'SF']]
bats.head()
print(len(bats))
bbdata2 = pd.merge(bbmaster, bats)
bbdata2.head(2)

110495

    playerID nameFirst nameLast    nameGiven  yearID  AB  H  BB  HBP   SF
0  aardsda01     David  Aardsma  David Allan    2004   0  0   0  0.0  0.0
1  aardsda01     David  Aardsma  David Allan    2006   2  0   0  0.0  0.0

In [9]:
salaries = pd.read_csv('C:/Users/19739/Desktop/Money Ball/Money_Ball/Resources/Salaries.csv')
salaries.columns

Index(['yearID', 'teamID', 'lgID', 'playerID', 'salary'], dtype='object')

In [10]:
salaries = salaries[['yearID', 'playerID', 'salary']]
print(len(salaries))
salaries.head(2)

26428

   yearID   playerID  salary
0    1985  barkele01  870000
1    1985  bedrost01  550000

In [11]:
bbdata_sal = pd.merge(bbdata2, salaries)
print(len(bbdata_sal))
bbdata_sal.head()

28294

,playerID,nameFirst,nameLast,nameGiven,yearID,AB,H,BB,HBP,SF,salary
0,aardsda01,David,Aardsma,David Allan,2004,0,0,0,0.0,0.0,300000
1,aardsda01,David,Aardsma,David Allan,2007,0,0,0,0.0,0.0,387500
2,aardsda01,David,Aardsma,David Allan,2008,1,0,0,0.0,0.0,403250
3,aardsda01,David,Aardsma,David Allan,2009,0,0,0,0.0,0.0,419000
4,aardsda01,David,Aardsma,David Allan,2010,0,0,0,0.0,0.0,2750000

In [12]:
# Drop all AB values of 0 or null (average at-bats in MLB is 30/year)
bbdata_sal = bbdata_sal.drop(bbdata_sal.index[(bbdata_sal['AB'] < 15) | \
                                              (bbdata_sal['H']  < 1) | \
                                              (pd.isnull(bbdata_sal['AB']))])

In [13]:
bbdata_sal['OBP'] = bbdata_sal.apply(lambda row: (row['H'] + row['BB'] + row['HBP']) * 100 / \
                                     (row['AB'] + row['BB'] + row['HBP'] + row['SF']), axis=1)

In [17]:
bbdata_sal.sort_values(['OBP'], ascending=False).head(2)

,playerID,nameFirst,nameLast,nameGiven,yearID,AB,H,BB,HBP,SF,salary,OBP
2518,bondsba01,Barry,Bonds,Barry Lamar,2004,373,135,232,9.0,3.0,18000000,60.940032
2516,bondsba01,Barry,Bonds,Barry Lamar,2002,403,149,198,9.0,2.0,15000000,58.169935

In [18]:
bbdata_sal = bbdata_sal.drop(bbdata_sal.index[bbdata_sal['salary'] <= 0])
pass

In [20]:
bbdata_sal['OBP_sal_10k'] = bbdata_sal.apply(lambda row: row['OBP'] * 10000 / row['salary'], axis=1)
bbdata_sal.sort_values('OBP_sal_10k', ascending=False).head(2)

,playerID,nameFirst,nameLast,nameGiven,yearID,AB,H,BB,HBP,SF,salary,OBP,OBP_sal_10k
23508,silveda01,Dave,Silvestri,David Joseph,1993,21,6,5,0.0,0.0,10900,42.307692,38.814397
8849,gibbojo02,John,Gibbons,John Michael,1986,19,9,3,0.0,0.0,65000,54.545455,8.391608

In [22]:
appearances = pd.read_csv('C:/Users/19739/Desktop/Money Ball/Money_Ball/Resources/Appearances.csv')
appearances.columns

Index(['yearID', 'teamID', 'lgID', 'playerID', 'G_all', 'GS', 'G_batting',
       'G_defense', 'G_p', 'G_c', 'G_1b', 'G_2b', 'G_3b', 'G_ss', 'G_lf',
       'G_cf', 'G_rf', 'G_of', 'G_dh', 'G_ph', 'G_pr'],
      dtype='object')

In [23]:
appearances.pop('lgID')
appearances.pop('teamID')
pass

In [24]:
print(len(appearances))
appearances.head(2)

110423

,yearID,playerID,G_all,GS,G_batting,G_defense,G_p,G_c,G_1b,G_2b,G_3b,G_ss,G_lf,G_cf,G_rf,G_of,G_dh,G_ph,G_pr
0,1871,abercda01,1,1.0,1,1.0,0,0,0,0,0,1,0,0,0,0,0.0,0.0,0.0
1,1871,addybo01,25,25.0,25,25.0,0,0,0,22,0,3,0,0,0,0,0.0,0.0,0.0

In [25]:
mb_data = pd.merge(appearances, bbdata_sal)
print(len(mb_data))
mb_data.head(2)

20033

,yearID,playerID,G_all,GS,G_batting,G_defense,G_p,G_c,G_1b,G_2b,...,nameLast,nameGiven,AB,H,BB,HBP,SF,salary,OBP,OBP_sal_10k
0,1985,aguaylu01,91,42.0,91,82.0,0,0,0,17,...,Aguayo,Luis,165,46,22,6.0,3.0,237000,37.755102,1.593042
1,1985,almonbi01,88,61.0,88,79.0,0,0,7,0,...,Almon,William Francis,244,66,22,1.0,3.0,255000,32.962963,1.292665

In [44]:
#ROSTER TIME / Rules of baseball ### Change Pitcher to DH 
ROSTER=['G_p', 'G_c', 'G_1b', 'G_2b','G_3b', 'G_ss', 'G_lf', 'G_cf', 'G_rf']

In [45]:
def mb_players(year, pos):
    return mb_data[(mb_data['yearID'] == year) & (mb_data[pos] > 5)][:100].sort_values('OBP_sal_10k', ascending=False)

In [52]:
def mb_roster(year):
    mbr_uf = []
    for pos in ROSTER:
        mbr_uf.append(mb_players(year, pos))
        
    ret = []
    no_overlap = []
    player_list = []
    for pos in mbr_uf:
        for n in range(len(pos)):
            if pos.iloc[n].playerID not in player_list:
                no_overlap.append(n)
        player_list.append(pos.iloc[no_overlap[0]].playerID)
        ret.append(pos.iloc[no_overlap[0]])
        no_overlap = []
                       
    return pd.DataFrame(ret)

In [68]:
#PLug in a year & Enjoy!!!!

mb_roster(2016)

,yearID,playerID,G_all,GS,G_batting,G_defense,G_p,G_c,G_1b,G_2b,...,nameLast,nameGiven,AB,H,BB,HBP,SF,salary,OBP,OBP_sal_10k
19714,2016,jacksed01,8,0.0,8,8.0,8,0,0,0,...,Jackson,Edwin,23,5,3,0.0,0.0,507500,30.769231,0.606290
19973,2016,sucreje01,9,8.0,9,9.0,0,9,0,0,...,Sucre,Jesus Marcelo,25,12,2,2.0,0.0,512000,55.172414,1.077586
19588,2016,dietrde01,128,96.0,128,107.0,0,0,16,75,...,Dietrich,Derek Richard,351,98,32,24.0,5.0,522500,37.378641,0.715381
19639,2016,garcigr01,99,50.0,99,78.0,0,0,0,26,...,Garcia,Greg Joseph,214,59,38,4.0,1.0,507500,39.299611,0.774377
20010,2016,villajo01,156,152.0,156,153.0,0,0,0,11,...,Villar,Jonathan Rafael,589,168,79,2.0,4.0,512900,36.943620,0.720289
19989,2016,tomlike01,52,24.0,52,30.0,0,0,0,19,...,Tomlinson,Kelby Aaron,106,31,12,1.0,0.0,512500,36.974790,0.721459
19879,2016,ramirjo01,152,144.0,152,151.0,0,0,0,9,...,Ramirez,Jose Enrique,565,176,44,4.0,4.0,518200,36.304700,0.700592
19964,2016,stubbdr01,20,8.0,20,13.0,0,0,0,0,...,Stubbs,Robert Andrew,20,6,4,0.0,1.0,507500,40.000000,0.788177
19635,2016,fuentre01,13,12.0,13,12.0,0,0,0,0,...,Fuentes,Reymond Louis,41,13,3,0.0,0.0,508450,36.363636,0.715186